Online Sales Data Analysis

Orders.csv has : Order ID (primary key), Order Date, CustomerName, State, City ->Customer details.

Details.csv contains: Order ID (primary key) and the details of all the subsequent orders within the Orders.csv ->Order details.

In [1]:
#Libraries
import numpy as np 
import pandas as pd 

import seaborn as sns
import matplotlib.pyplot as plt

import os

In [2]:
path = '/Users/josephzhuo/anaconda_projects/eg-online-sales-analysis'

details = pd.read_csv(path + '/Details.csv')
orders = pd.read_csv(path + '/Orders.csv')

In [3]:
details.head()

,Order ID,Amount,Profit,Quantity,Category,Sub-Category,PaymentMode
0,B-25681,1096,658,7,Electronics,Electronic Games,COD
1,B-26055,5729,64,14,Furniture,Chairs,EMI
2,B-25955,2927,146,8,Furniture,Bookcases,EMI
3,B-26093,2847,712,8,Electronics,Printers,Credit Card
4,B-25602,2617,1151,4,Electronics,Phones,Credit Card

In [4]:
orders.head()

  Order ID  Order Date CustomerName           State     City
0  B-26055  10-03-2018    Harivansh   Uttar Pradesh  Mathura
1  B-25993  03-02-2018       Madhav           Delhi    Delhi
2  B-25973  24-01-2018  Madan Mohan   Uttar Pradesh  Mathura
3  B-25923  27-12-2018        Gopal     Maharashtra   Mumbai
4  B-25757  21-08-2018     Vishakha  Madhya Pradesh   Indore

In [5]:
# Checking null values
def check_null_values(dataframes):
    print("=[ Checking NULL Values ]=")
    for name, df in dataframes.items():
        print(f"\nNull values in {name}:\n{df.isna().sum()}\n")

# Checking unique values
def check_unique_values(dataframes, cat_columns_dict):
    print("=[ Checking UNIQUE Values ]=\n")
    for name, df in dataframes.items():
        cat_columns = cat_columns_dict[name]
        for col in cat_columns:
            unique_values = df[col].unique()
            print(f"Unique values in '{col}' ({name}):\n{unique_values}\n")

In [6]:
# Remove unecessary categorical columns to find unique values (eg. ID)
details_cat_columns = details.select_dtypes(
                                            object
                                        ).drop(
                                            'Order ID', axis = 1
                                        ).columns

orders_cat_columns = orders.select_dtypes(
                                            object
                                        ).drop(
                                            ['Order ID', 'Order Date'], axis = 1
                                        ).columns

# Dataframe Dictionary
dataframes = {
    'Details Dataframe' : details,
    'Orders Dataframe' : orders
}

# Store categorical columns separately
cat_columns_dict = {
    'Details Dataframe': details_cat_columns,
    'Orders Dataframe': orders_cat_columns
}

In [7]:
check_null_values(dataframes)

=[ Checking NULL Values ]=

Null values in Details Dataframe:
Order ID        0
Amount          0
Profit          0
Quantity        0
Category        0
Sub-Category    0
PaymentMode     0
dtype: int64


Null values in Orders Dataframe:
Order ID        0
Order Date      0
CustomerName    0
State           0
City            0
dtype: int64

In [8]:
check_unique_values(dataframes, cat_columns_dict)

=[ Checking UNIQUE Values ]=

Unique values in 'Category' (Details Dataframe):
['Electronics' 'Furniture' 'Clothing']

Unique values in 'Sub-Category' (Details Dataframe):
['Electronic Games' 'Chairs' 'Bookcases' 'Printers' 'Phones' 'Trousers'
 'Saree' 'Hankerchief' 'Kurti' 'Skirt' 'Tables' 'Stole' 'Leggings'
 'Accessories' 'T-shirt' 'Furnishings' 'Shirt']

Unique values in 'PaymentMode' (Details Dataframe):
['COD' 'EMI' 'Credit Card' 'UPI' 'Debit Card']

Unique values in 'CustomerName' (Orders Dataframe):
['Harivansh' 'Madhav' 'Madan Mohan' 'Gopal' 'Vishakha' 'Sudevi' 'Shiva'
 'Sarita' 'Shishu' 'Vrinda' 'Uudhav' 'Shreyshi' 'Bhishm' 'Yogesh' 'Lalita'
 'Rohan' 'Gaurav' 'Amol' 'Aastha' 'Pooja' 'Shrichand' 'Hitesh' 'Shourya'
 'Ishpreet' 'Sudhir' 'Sauptik' 'Lisha' 'Bhawna' 'Sujay' 'Jay' 'Shruti'
 'Mohan' 'Neha' 'Shreyoshe' 'Hemant' 'Madhulika' 'Shardul' 'Sheetal'
 'Pournamasi' 'Surabhi' 'Manshul' 'Parth' 'Siddharth' 'Priyanka' 'Aarushi'
 'Vaibhav' 'Savi' 'Jahan' 'Parishi' 'Farah' 'Abhijeet' 'Anudeep' 'Yohann'
 'Girase' 'Arpita' 'Vijay' 'Arti' 'Bharat' 'Divyeta' 'Manju' 'Oshin'
 'Chandni' 'Pranjali' 'Monu' 'Krutika' 'Sanjana' 'Mahima' 'Rishabh'
 'Dashyam' 'Tulika' 'Nripraj' 'Vikash' 'Mukesh' 'Ankit' 'Aditi' 'Ayush'
 'Parin' 'Kirti' 'Ameesha' 'Anjali' 'Shivam' 'Anurag' 'Shaily' 'Tanvi'
 'Shreya' 'Chirag' 'Shweta' 'Abhishek' 'Hrisheekesh' 'Kartik' 'Trupti'
 'Noopur' 'Harsh' 'Swapnil' 'Soumyabrata' 'Amruta' 'Aishwarya' 'Pranav'
 'Sahil' 'Mitali' 'Hitika' 'Paromita' 'Jitesh' 'Pratyusmita' 'Atharv'
 'Ajay' 'Diwakar' 'Rutuja' 'Sanjova' 'Shivanshu' 'Mhatre' 'Snel' 'Praneet'
 'Jesal' 'Rhea' 'Mrinal' 'Sharda' 'Shatayu' 'Chikku' 'Akancha' 'Amit'
 'Kishwar' 'Muskan' 'Shubham' 'Vini' 'Manisha' 'Charika' 'Ankur' 'Aniket'
 'Nishi' 'Tanushree' 'Pinky' 'Yash' 'Parna' 'Sukrith' 'Dhanraj' 'Megha'
 'Piyali' 'Anand' 'Monica' 'Avish' 'Atul' 'Shivangi' 'Mayank' 'Kasheen'
 'Asish' 'Tejeswini' 'Priyanshu' 'Nikita' 'Monisha' 'Nishant' 'Kartikay'
 'Amisha' 'Soumya' 'Harshita' 'Aman' 'Brijesh' 'Vandana' 'Kiran' 'Paridhi'
 'Navdeep' 'Bhaggyasree' 'Vineet' 'Divyansha' 'Kajal' 'Amlan' 'Sabah'
 'Surbhi' 'Hazel' 'Sonal' 'Srishti' 'Shikhar' 'Divsha' 'Nida' 'Mane'
 'Sanjay' 'Sathya' 'Sanjna' 'Sweta' 'Nidhi' 'Sakshi' 'Devendra'
 'Aparajita' 'Ramesh' 'Swetha' 'Apoorva' 'Stuti' 'K' 'Kushal' 'Aayushi'
 'Deepak' 'Prashant' 'Bathina' 'Turumella' 'Sudheer' 'Akshay' 'Sagar'
 'Ashmeet' 'Manjiri' 'Sneha' 'Chetan' 'Komal' 'Bhosale' 'Sukruta' 'Sukant'
 'Yaanvi' 'Palak' 'Kshitij' 'Mrunal' 'Kanak' 'Divyeshkumar' 'Karandeep'
 'Ekta' 'Subhashree' 'Nitant' 'Aayush' 'Aditya' 'Apsingekar' 'Anita'
 'Tushina' 'Kalyani' 'Divyansh' 'Ginny' 'Omkar' 'Adhvaita' 'Piyam'
 'Shefali' 'Anchal' 'Manibalan' 'Mansi' 'Pradeep' 'Jaideep' 'Ritu'
 'Suhani' 'Sandra' 'Syed' 'Subhasmita' 'Chayanika' 'Nandita' 'Suraj'
 'Raksha' 'Moumita' 'Bhavna' 'Suman' 'Bhargav' 'Mukund' 'Shantanu' 'Patil'
 'Vaibhavi' 'Sanskriti' 'Prajakta' 'Saptadeep' 'Saurabh' 'Anisha'
 'Arsheen' 'Rashmi' 'Meghana' 'Teena' 'Samiksha' 'Daksh' 'Akash' 'Shubhi'
 'Riya' 'Utsav' 'Ishit' 'Smriti' 'Ankita' 'Masurkar' 'Shivani' 'Dheeraj'
 'Gunjal' 'Ashmi' 'Jesslyn' 'Sonakshi' 'Vipul' 'Apoorv' 'Rahul'
 'Geetanjali' 'Preksha' 'Shyam' 'Aromal' 'Jayanti' 'Kritika' 'Arindam'
 'Maithilee' 'Sandeep' 'Soodesh' 'Parnavi' 'Swati' 'Parakh' 'Arun'
 'Utkarsh' 'Nirja' 'Abhijit' 'Avni' 'Wale' 'Sidharth' 'Bhutekar' 'Mugdha'
 'Aryan' 'Krishna' 'Nikhil' 'Rane' 'Noshiba' 'Dipali' 'Vivek' 'Pratiksha'
 'Akshata' 'Duhita' 'Anmol' 'Inderpreet' 'Mousam' 'Dhirajendu' 'Sajal'
 'Aakanksha' 'Phalguni' 'Snehal' 'Manish' 'Tejas' 'Pearl' 'Gunjan'
 'Swetlana' 'Akshat' 'Namrata' 'Jaydeep' 'Rachna' 'Akanksha' 'Sumeet'
 'Ashvini' 'Saloni' 'Anubhaw' 'Ananya' 'Rohit' 'Hemangi' 'Dinesh' 'Ashwin']

Unique values in 'State' (Orders Dataframe):
['Uttar Pradesh' 'Delhi' 'Maharashtra' 'Madhya Pradesh' 'Andhra Pradesh'
 'Gujarat' 'Bihar' 'Himachal Pradesh' 'Punjab' 'Kerala ' 'Nagaland'
 'Haryana' 'Rajasthan' 'Karnataka' 'Tamil Nadu' 'West Bengal'
 'Jammu and Kashmir' 'Goa' 'Sikkim']

Unique values in 'City' (Orders Dataframe):
['Mathura' 'Delhi' 'Mumbai' 'Indore' 'Prayagraj' 'Pune' 'Hyderabad'
 'Surat' 'Ahmedabad' 'Patna' 'Simla' 'Chandigarh' 'Bhopal'
 'Thiruvananthapuram' 'Kohima' 'Udaipur' 'Bangalore' 'Lucknow' 'Chennai'
 'Kolkata' 'Kashmir' 'Jaipur' 'Amritsar' 'Goa' 'Gangtok']

In [9]:
# Checking numerical details in details Dataframe
details.describe()

            Amount      Profit     Quantity
count  1500.000000  1500.00000  1500.000000
mean    291.847333    24.64200     3.743333
std     461.924620   168.55881     2.184942
min       4.000000 -1981.00000     1.000000
25%      47.750000   -12.00000     2.000000
50%     122.000000     8.00000     3.000000
75%     326.250000    38.00000     5.000000
max    5729.000000  1864.00000    14.000000

In [10]:
# Checking numerical details in orders Dataframe
orders.describe()

       Order ID  Order Date CustomerName        State    City
count       500         500          500          500     500
unique      500         307          336           19      25
top     B-26091  24-11-2018       Shreya  Maharashtra  Indore
freq          1           7            6           94      71

In [11]:
# Left join details to orders (details table is the left) 
# Check the dim of merged table
merged_df = pd.merge(
    details, orders, on = 'Order ID', how = 'left'
)
merged_df.shape

(1500, 11)

In [12]:
# Table loading to PBI
merged_df.to_csv('/Users/josephzhuo/anaconda_projects/eg-online-sales-analysis/data_pbi.csv', index=False)

# To check if the file was created successfully
if os.path.exists('data_pbi.csv'):
    print("CSV file created successfully!")

CSV file created successfully!